int/resources/objectRepo/xmlTemplates/opera/Reservation/req_CancelReservation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/rsv/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CancelReservationRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" VerificationOnly="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:RateChangeInstruction RateChange="?">
            <v91:Discount Amount="?" CurrencyCode="?" DiscountCode="?" Percent="?">
               <v91:DiscountReason/>
            </v91:Discount>
         </v9:RateChangeInstruction>
         <v9:Reason Code="?">
            <v91:Description/>
         </v9:Reason>
         <v9:Reservations>
            <v9:Reservation AccessRestriction="?" AdvanceCheckedIn="?" AllowMobileCheckout="?" AllowMobileViewFolio="?" CommissionPayoutTo="?" ComputedResStatus="?" CreateDateTime="?" CreatorID="?" ExpectedServiceTime="?" HotelCode="?" HotelName="?" LastModifierID="?" LastModifyDateTime="?" OpenFolio="?" OptedForCommunication="?" OverrideExternalChecks="?" PaymentMethod="?" PreRegistered="?" PurgeDate="?" ResStatus="?" RoomStayReservation="?" WalkInIndicator="?">
               <v91:ReservationIDList>
                  <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
               </v91:ReservationIDList>
               <v91:RoomStay PseudoRoom="?" RoomNumberLocked="?" ScheduledCheckoutTime="?">
                  <v91:TimeSpan>
                     <v91:StartDate/>
                     <v91:EndDate/>
                     <v91:Duration/>
                  </v91:TimeSpan>
                  <v91:OriginalTimeSpan>
                     <v91:StartDate/>
                     <v91:EndDate/>
                     <v91:Duration/>
                  </v91:OriginalTimeSpan>
                  <v91:ExpectedTimes ResExpectedArrivalTime="?" ResExpectedDepartureTime="?" ResExpectedReturnTime="?"/>
                  <v91:AdultCount/>
                  <v91:ChildCount/>
                  <v91:RoomClass/>
                  <v91:RoomType/>
                  <v91:NumberOfRooms/>
                  <v91:RoomNumber/>
                  <v91:RatePlanCode/>
                  <v91:RateAmount Amount="?" CurrencyCode="?"/>
                  <v91:Points AwardsType="?" Points="?"/>
                  <v91:RateSuppressed/>
                  <v91:ReservationBlock HotelCode="?">
                     <v91:BlockIDList>
                        <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                     </v91:BlockIDList>
                     <v91:BlockName/>
                  </v91:ReservationBlock>
                  <v91:BookingChannelCode/>
                  <v91:PartyCode/>
                  <v91:FixedRate/>
                  <v91:TotalAmount Amount="?" CurrencyCode="?"/>
                  <v91:Guarantee GuaranteeCode="?" OnHold="?" ShortDescription="?"/>
                  <v91:MarketCode/>
                  <v91:SourceOfBusiness/>
                  <v91:SourceOfBusinessDescription/>
                  <v91:Balance Amount="?" CurrencyCode="?"/>
                  <v91:CompBalance Amount="?" CurrencyCode="?"/>
                  <v91:RoomTypeCharged/>
                  <v91:DepositPayments Amount="?" CurrencyCode="?"/>
                  <v91:GuestServiceStatus/>
               </v91:RoomStay>
               <v91:ResGuest NameType="?">
                  <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                  <v91:Membership AccountID="?" BonusCode="?" MembershipLevel="?" MembershipLevelDesc="?" MembershipTypeDesc="?" ProgramCode="?"/>
                  <v91:NamePrefix/>
                  <v91:GivenName/>
                  <v91:AltGivenName/>
                  <v91:MiddleName/>
                  <v91:SurnamePrefix/>
                  <v91:Surname/>
                  <v91:AltSurname/>
                  <v91:NameSuffix/>
                  <v91:NameTitle/>
                  <v91:FullName/>
                  <v91:AltFullName/>
                  <v91:PhoneNumber/>
                  <v91:Email/>
                  <v91:BirthDate/>
                  <v91:Language/>
                  <v91:Nationality Code="?"/>
                  <v91:VIP VIPCode="?" VIPDescription="?"/>
                  <v91:Address ExcludeNoCity="?">
                     <v91:CityName/>
                     <v91:PostalCode/>
                     <v91:State/>
                     <v91:CountryName Code="?"/>
                     <v91:StreetAddress/>
                  </v91:Address>
                  <v91:AccompanyGuests>
                     <v91:AccompanyGuest>
                        <v91:FirstName/>
                        <v91:LastName/>
                        <v91:FullName/>
                        <v91:RegistrationCardNo/>
                        <v91:ProfileIDList>
                           <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                        </v91:ProfileIDList>
                     </v91:AccompanyGuest>
                  </v91:AccompanyGuests>
                  <v91:ExternalInfo>
                     <v91:GivenName/>
                     <v91:Surname/>
                  </v91:ExternalInfo>
                  <v91:GuestLastStayInfo>
                     <v91:LastStayDate/>
                     <v91:LastStayRoom/>
                     <v91:LastStayRate Amount="?" CurrencyCode="?"/>
                     <v91:TotalStay/>
                  </v91:GuestLastStayInfo>
                  <v91:GuestRestrictedCode/>
                  <v91:GuestRestrictedReasonDesc/>
                  <v91:GuestRestricted/>
                  <v91:RegistrationCardNo/>
               </v91:ResGuest>
               <v91:SharedGuests>
                  <v91:SharedGuest>
                     <v91:ProfileID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                     <v91:FirstName/>
                     <v91:LastName/>
                     <v91:FullName/>
                  </v91:SharedGuest>
               </v91:SharedGuests>
               <v91:AttachedProfiles>
                  <v91:AttachedProfile ResProfileType="?">
                     <v91:Name/>
                     <v91:ProfileIDList>
                        <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                     </v91:ProfileIDList>
                  </v91:AttachedProfile>
               </v91:AttachedProfiles>
               <v91:ReservationPaymentMethod Description="?" FolioView="?" PaymentMethod="?">
                  <v91:PaymentCard AttachCreditCardToProfile="?" CardHolderName="?" CardNumber="?" CardNumberMasked="?" CardNumberType="?" CardType="?" ExpirationDate="?" ExpirationDateExpired="?" ExpirationDateMasked="?" Processing="?" Swiped="?">
                     <v91:CardId ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                     <v91:CurrentAuthorizedAmount Amount="?" CurrencyCode="?"/>
                     <v91:ApprovalAmountNeeded Amount="?" CurrencyCode="?"/>
                  </v91:PaymentCard>
                  <v91:Balance Amount="?" CurrencyCode="?"/>
                  <v91:AuthorizationRule>
                     <v91:Code/>
                     <v91:Amount Amount="?" CurrencyCode="?"/>
                     <v91:Percent/>
                  </v91:AuthorizationRule>
                  <v91:EmailFolioInfo EmailFolio="?">
                     <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                     <v91:Email EmailAddress="?" EmailFormat="?" OrderSequence="?" PrimaryInd="?" Type="?" TypeDescription="?"/>
                  </v91:EmailFolioInfo>
               </v91:ReservationPaymentMethod>
               <v91:Specials/>
               <v91:LastPrivacyPromptDate/>
               <v91:DisplayColor/>
               <v91:ReservationIndicators>
                  <v91:Indicator Count="?" IndicatorName="?"/>
               </v91:ReservationIndicators>
               <v91:RoomStatus/>
               <v91:SearchMatches>
                  <v91:SearchMatch Attribute="?" Value="?"/>
               </v91:SearchMatches>
               <v91:SourceOfSale SourceCode="?" SourceType="?"/>
               <v91:Waitlist PriorityCode="?" ReasonCode="?" Telephone="?">
                  <v91:ReasonDescription/>
                  <v91:PriorityDescription/>
                  <v91:Description/>
               </v91:Waitlist>
               <v91:Queue AvgQueueTimeCurrentReservations="?" AvgQueueTimeToCheckIn="?" Priority="?" QueueDate="?">
                  <v91:TimeSpan DurationInSeconds="?">
                     <v91:StartDate/>
                     <v91:EndDate/>
                     <v91:Duration/>
                  </v91:TimeSpan>
                  <v91:GuestTextInfo>
                     <v91:SentTime/>
                     <v91:SentBy/>
                  </v91:GuestTextInfo>
               </v91:Queue>
               <v91:Housekeeping ExpectedServiceTime="?" RoomStatus="?" ServiceTime="?" TurndownRequested="?">
                  <v91:Instructions/>
                  <v91:FacilityTaskInfo Date="?">
                     <v91:Task Code="?" HotelCode="?" Sequence="?">
                        <v91:Description/>
                        <v91:Instructions/>
                        <v91:FacilityDepartureTask/>
                        <v91:LinenChange/>
                     </v91:Task>
                     <v91:Supplies>
                        <v91:FacilityCode Code="?">
                           <v91:Description/>
                           <v91:Quantity/>
                        </v91:FacilityCode>
                     </v91:Supplies>
                  </v91:FacilityTaskInfo>
                  <v91:LinenChange/>
               </v91:Housekeeping>
               <v91:Cashiering FinanciallyResponsible="?" LastRoomAndTaxPostedDate="?" ProratedBilling="?" ReverseCheckInAllowed="?" TransactionsPosted="?">
                  <v91:RevenuesAndBalances>
                     <v91:TotalFixedCharge Amount="?" CurrencyCode="?"/>
                     <v91:TotalPayment Amount="?" CurrencyCode="?"/>
                     <v91:RoomRevenue Amount="?" CurrencyCode="?"/>
                     <v91:FoodAndBevRevenue Amount="?" CurrencyCode="?"/>
                     <v91:OtherRevenue Amount="?" CurrencyCode="?"/>
                     <v91:NonRevenue Amount="?" CurrencyCode="?"/>
                     <v91:TotalRevenue Amount="?" CurrencyCode="?"/>
                     <v91:Balance Amount="?" CurrencyCode="?"/>
                  </v91:RevenuesAndBalances>
                  <v91:BillingPrivileges AllowAutoCheckin="?" AutoSettlement="?" AutoSettlementFreq="?" AutoSettlementType="?" CreditLimitAutoPay="?" DirectBillAuthorized="?" FolioCloseDate="?" PostStayCharging="?" PostingRestriction="?" PreStayCharging="?" ScheduledCheckout="?" ScheduledCheckoutTime="?" VideoCheckout="?"/>
                  <v91:TaxType TaxExemptNo="?">
                     <v91:HotelCode/>
                     <v91:Code/>
                     <v91:Description/>
                     <v91:CollectingAgentTax/>
                     <v91:PrintAutoAdjust/>
                     <v91:ReportExemptDays/>
                     <v91:ReportTaxPerc/>
                  </v91:TaxType>
                  <v91:BedTaxReporting TaxRegistrationNo="?" TaxableDays="?" VisaExpiryDate="?" VisaIssueDate="?" VisaNumber="?"/>
                  <v91:FolioTexts>
                     <v91:FolioText Row="?" Text="?"/>
                  </v91:FolioTexts>
                  <v91:PeriodicFolio Frequency="?" LastFolioDate="?" LastSettlementDate="?"/>
                  <v91:CompAccounting Authorizer="?" CompType="?"/>
                  <v91:ResPreConfiguredRoutingInstruction ProfileType="?" RatePlanCode="?"/>
               </v91:Cashiering>
               <v91:TaxType>
                  <v91:HotelCode/>
                  <v91:Code/>
                  <v91:Description/>
                  <v91:CollectingAgentTax/>
                  <v91:PrintAutoAdjust/>
                  <v91:ReportExemptDays/>
                  <v91:ReportTaxPerc/>
               </v91:TaxType>
               <v91:Deposit HasOutstanding="?" HasPaid="?">
                  <v91:AmountRequired/>
                  <v91:AmountPaid/>
                  <v91:AmountOwed/>
                  <v91:DueDate/>
                  <v91:PostingDate/>
               </v91:Deposit>
               <v91:AllowedActions>
                  <v91:AllowedAction/>
               </v91:AllowedActions>
               <v91:RevenuesAndBalances>
                  <v91:TotalFixedCharge Amount="?" CurrencyCode="?"/>
                  <v91:TotalPayment Amount="?" CurrencyCode="?"/>
                  <v91:RoomRevenue Amount="?" CurrencyCode="?"/>
                  <v91:FoodAndBevRevenue Amount="?" CurrencyCode="?"/>
                  <v91:OtherRevenue Amount="?" CurrencyCode="?"/>
                  <v91:NonRevenue Amount="?" CurrencyCode="?"/>
                  <v91:TotalRevenue Amount="?" CurrencyCode="?"/>
                  <v91:Balance Amount="?" CurrencyCode="?"/>
               </v91:RevenuesAndBalances>
               <v91:HotelInterfaceStatusList>
                  <v91:RoomExtension/>
                  <v91:HotelInterface>
                     <v91:InterfaceId ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                     <v91:HotelCode/>
                     <v91:InterfaceName/>
                     <v91:InterfaceType/>
                     <v91:Logo/>
                     <v91:MachineName/>
                     <v91:Status/>
                     <v91:ActiveFlag/>
                  </v91:HotelInterface>
                  <v91:InterfaceRights>
                     <v91:Right/>
                     <v91:StatusCode/>
                     <v91:Description/>
                     <v91:Category/>
                  </v91:InterfaceRights>
               </v91:HotelInterfaceStatusList>
               <v91:GuestPreferredCurrency/>
               <v91:TurndownInfo>
                  <v91:Allowed/>
                  <v91:Status/>
               </v91:TurndownInfo>
               <v91:MobileNotifications>
                  <v91:RoomReady/>
                  <v91:KeyReady/>
                  <v91:CheckoutMessageReceived/>
                  <v91:RequiresAction/>
                  <v91:ErrorMessage/>
               </v91:MobileNotifications>
               <v91:ResCommunication>
                  <v91:Telephones AllRowsFetched="?" TotalRows="?">
                     <v91:TelephoneInfo>
                        <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                        <v91:Telephone Extension="?" OrderSequence="?" PhoneNumber="?" PhoneTechType="?" PhoneUseType="?" PhoneUseTypeDescription="?" PrimaryInd="?"/>
                     </v91:TelephoneInfo>
                  </v91:Telephones>
                  <v91:Emails AllRowsFetched="?" TotalRows="?">
                     <v91:EmailInfo>
                        <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                        <v91:Email EmailAddress="?" EmailFormat="?" OrderSequence="?" PrimaryInd="?" Type="?" TypeDescription="?"/>
                     </v91:EmailInfo>
                  </v91:Emails>
               </v91:ResCommunication>
               <v91:CxlInstr DeleteResTraces="?" Status="?"/>
               <v91:RefResId ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
               <v91:ReservationLockHandle/>
            </v9:Reservation>
         </v9:Reservations>
         <v9:ChannelInformation RetransmissionIndicator="?">
            <v91:ChannelSummaryInfo MessageID="?" SummaryOnly="?">
               <v91:BookingChannel ChannelCode="?" ChannelName="?" ChannelType="?"/>
            </v91:ChannelSummaryInfo>
            <v91:LinkedConfirmationNumber ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
            <v91:ChannelResvAction/>
         </v9:ChannelInformation>
      </v9:CancelReservationRQ>
   </soapenv:Body>
</soapenv:Envelope>